Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This function will draw text in a similar way to draw_text() only now you can choose to scale the text along the horizontal or vertical axis (effectively stretching or shrinking it) and also have GameMaker draw it at an angle (where 0 is normal and every degree over 0 rotates the text anti-clockwise).
zh_cn: 此函数将以与draw_text()相似的方式绘制文本，只是现在您可以选择沿水平轴或垂直轴缩放文本(有效地拉伸或收缩文本)，并且还可以让GameMaker以某个角度绘制文本(其中0°为正常，超过0°的每一度都逆时针旋转文本)。

source: This function will draw text in a similar way to draw_text() only now you can set the space between each line of text - should the text occupy more than one line - and limit the width (in pixels) of the string per line so that should any line exceed this value, GameMaker will automatically split the text to the next line at the nearest available white-space (if the text has no white-spaces then it will overrun this maximum width value).
zh_cn: 此函数将以与draw_text()相似的方式绘制文本，只是现在您可以设置每行文本之间的间距(如果文本占用多行)并限制每行字符串的宽度(以像素为单位),这样，如果任何一行超出该值，GameMaker将自动在最近的可用空格处将文本拆分到下一行(如果文本没有空格，则它将超出该最大宽度值)。

source: This function will draw the collision masks associated with the given skeletal animation.
zh_cn: 此函数将绘制与给定骨骼动画相关的碰撞遮罩。

source: This function will draw the currently selected video to surfaces which will then be used to draw the video
zh_cn: 此函数将把当前选择的视频绘制到表面，这些表面将被用来绘制视频

source: This function will draw the given animation using the given skin at a specific time in the animation.
zh_cn: 此函数将在动画中的特定时间使用给定的皮肤绘制给定的动画。

source: This function will draw the given sprite as in the function draw_sprite() but with additional options to change the scale, blending, rotation and alpha of the sprite being drawn.
zh_cn: 此函数将像draw_sprite()函数一样绘制给定的精灵，但有额外的选项来更改所绘制精灵的比例、混合、旋转和alpha。

source: This function will draw the given surface as in the function draw_surface() but with additional options to change the scale, blending, rotation and alpha of the surface being drawn.
zh_cn: 此函数将像函数draw_surface()一样绘制给定的表面，但是有额外的选项来改变所绘制表面的比例、混合、旋转和alpha。

source: This function will draw the specified MP grid (as defined by mp_grid_create()), marking free cells as green and forbidden cells as red.
zh_cn: 此函数将绘制指定的MP网格(由mp_grid_create()定义)，将自由单元格标记为绿色，将禁止单元格标记为红色。

source: This function will enable or disable alpha testing for your game (by default this is disabled).
zh_cn: 此函数将为你的游戏启用或禁用alpha测试(默认是禁用的)。

source: This function will enable or disable the loop
zh_cn: 此函数将启用或禁用循环

source: This function will get the current GPU state, returning it as a DS Map.
zh_cn: 此函数将获取当前的GPU状态，并以DS Map的形式返回。

source: This function will get the font currently assigned for drawing text.
zh_cn: 此函数将获取当前分配给绘图文本的字体。

source: This function will get the position (in seconds) within the sound file for the sound to play from.
zh_cn: 此函数将获得声音文件中播放声音的位置(以秒为单位)。

source: This function will get the specified light parameters as an array with the following 6 elements -
zh_cn: 此函数将指定的灯光参数作为一个数组，包含以下6个元素-

source: This function will get you the object_index of any parent that has been assigned to the specified object, or else return -100 to show that the object has no parent assigned to it, or -1 if the object being checked does not exist.
zh_cn: 此函数将为您获取已被分配给指定对象的任何父对象的object_index，或者返回-100表示对象没有被分配给它，或者返回-1表示正在检查的对象不存在。

source: This function will give an angular impulse to a physics enabled instance.
zh_cn: 此函数将为启用物理的实例提供一个角度脉冲。

source: This function will load a CSV format file and convert it into a DS grid, returning the unique ID value for the grid created.
zh_cn: 此函数将加载CSV格式文件并将其转换为DS网格，返回创建的网格的惟一ID值。

source: This function will load a previously saved DS map from the given file.
zh_cn: 此函数将从给定文件加载以前保存的DS map。

source: This function will load a secure saved DS map from a buffer.
zh_cn: 此函数将从缓冲区加载一个安全的已保存DS map。

source: This function will load all the sounds that are flagged as belonging to the given Audio Group into memory.
zh_cn: 此函数将加载所有标记为属于给定音频组的声音到内存中。

source: This function will load some of the buffer data that was previously saved using the buffer_save() functions into an already created buffer.
zh_cn: 此函数将把以前使用buffer_save()函数保存的一些缓冲区数据加载到已经创建的缓冲区中。

source: This function will load the buffer data that was previously saved using the buffer_save() functions into an already created buffer.
zh_cn: 此函数将把之前使用buffer_save()函数保存的缓冲区数据加载到一个已经创建的缓冲区中。

source: This function will merge the sprite indexed in argument 1 ("ind2") with that which is indexed in argument 0 ("ind1").
zh_cn: 此函数将把参数1("ind2")中索引的sprite与参数0("ind1")中索引的sprite合并。

source: This function will modify the current direction and speed of the instance running the code, combining the values given with the current values.
zh_cn: 此函数将结合给定值和当前值，修改运行代码的实例的当前方向和速度。

source: This function will move the instance running the code a set number of pixels in the specified direction until it meets an instance with solid flagged as true.
zh_cn: 此函数会将运行代码的实例向指定的方向移动一组像素，直到遇到一个solid标记为true的实例。

source: This function will move the instance running the code a set number of pixels in the specified direction until it meets any other instance with a valid mask.
zh_cn: 此函数将运行代码的实例向指定方向移动一组像素，直到它遇到任何其他具有有效掩码的实例。

source: This function will move the position of the video in milliseconds
zh_cn: 此函数将以毫秒为单位移动视频的位置

source: This function will multiply the value of a the given grid cell by the specified amount.
zh_cn: 此函数将给定网格单元格的值乘以指定的数量。

source: This function will not alter the original buffer.
zh_cn: 此函数不会改变原始缓冲区。

source: This function will only affect things drawn in the Draw GUI Event and can be used to set a specific width and height for all GUI components in that event, and no matter what size of display or window is used to display the GUI, it will be scaled to fit correctly.
zh_cn: 此函数将仅影响在Draw GUI事件中绘制的内容，并且可用于为该事件中的所有GUI组件设置特定的宽度和高度，并且无论使用何种大小的显示器或窗口来显示GUI，都将对其进行缩放以正确适应。

source: This function will only be triggered once for any mouse button when it is first pressed and to trigger it again the button will need to have been released and pressed again.
zh_cn: 当鼠标按钮第一次被按下时，此函数只会被触发一次，而要再次触发该按钮，则需要释放并再次按下该按钮。

source: This function will only be triggered once for any mouse button when it is released and to trigger it again the button will need to have been pressed and released again.
zh_cn: 对于任何鼠标按钮，此函数仅在释放时触发一次，要再次触发此函数，需要再次按下并释放该按钮。

source: This function will only read the first value of the queue (that which is "at the head").
zh_cn: 此函数将只读取队列的第一个值(即"在头部"的值)。

source: This function will only read the first value of the stack (that which is "on top").
zh_cn: 此函数将只读取堆栈的第一个值(即"在顶部"的值)。

source: This function will only read the last value of the queue (that which is "at the tail").
zh_cn: 此函数将只读取队列的最后一个值(即"在尾部"的值)。

source: This function will open a stored zip file and extract its contents to the given directory.
zh_cn: 此函数将打开一个存储的zip文件，并将其内容提取到给定的目录中。

source: This function will open the achievements page for the chosen platform.
zh_cn: 此函数将打开所选平台的成就页面。

source: This function will open the binary file with the indicated name.
zh_cn: 此函数将用指定的名称打开二进制文件。

source: This function will open the leaderboards page for the chosen platform.
zh_cn: 此函数将打开所选平台的排行榜页面。

source: This function will pause the video
zh_cn: 此函数将暂停视频

source: This function will perform the specified event, with the designated argument, for the instance running the code.
zh_cn: 此函数将使用指定的参数为运行代码的实例执行指定的事件。

source: This function will pop the top value off of the DS stack , removing it from the stack and returning the value to be stored in a variable.
zh_cn: 此函数将从DS堆栈中弹出顶部的值，从堆栈中删除它，并返回要存储在变量中的值。

source: This function will populate a pre-made DS map with a series of key/value pairs for the first local push notification in the queue to be shown.
zh_cn: 此函数将使用一系列键/值对填充一个预先制作的DS map，用于显示队列中的第一个本地推送通知。

source: This function will populate a pre-made DS map with a series of key/value pairs for the next local push notification in the queue to be shown.
zh_cn: 此函数将使用一系列键/值对填充一个预先制作的DS map，以便显示队列中的下一个本地推送通知。

source: This function will push (add) a value, which can be of any data type, onto the top of the stack.
zh_cn: 此函数将把一个值(可以是任何数据类型)推到堆栈的顶部。

source: This function will remove a directory with the given name in the save area.
zh_cn: 此函数将删除保存区域中具有给定名称的目录。

source: This function will remove all defined emitters from the given system and clear them from memory (this will also stop any particles from being produced by the given emitter, but it does NOT remove them from the room).
zh_cn: 此函数将从给定系统中移除所有已定义的发射器，并将其从内存中清除(这也将阻止给定发射器产生任何粒子，但不会将它们从房间中移除)。

source: This function will remove the given grid data-structure from memory, freeing up the resources it was using and removing all values that it contained.
zh_cn: 此函数将从内存中删除给定的网格数据结构，释放它正在使用的资源并删除其中包含的所有值。

source: This function will remove the given list data-structure from memory, freeing up the resources it was using and removing all values that it contained.
zh_cn: 此函数将从内存中删除给定的列表数据结构，释放它正在使用的资源，并删除它包含的所有值。

source: This function will remove the given priority queue data-structure from memory, freeing up the resources it was using and removing all values that it contained.
zh_cn: 此函数将从内存中删除给定的优先级队列数据结构，释放它正在使用的资源并删除它所包含的所有值。

source: This function will remove the given queue data-structure from memory, freeing up the resources it was using and removing all values that it contained.
zh_cn: 此函数将从内存中删除给定的队列数据结构，释放它正在使用的资源，并删除它包含的所有值。

source: This function will remove the given stack data-structure from memory, freeing up the resources it was using and removing all values that it contained.
zh_cn: 此函数将从内存中删除给定的堆栈数据结构，释放它正在使用的资源并删除它所包含的所有值。

source: This function will remove the specified emitter from the given system and clear it from memory (this will also stop any particles from being produced by the given emitter, but it does NOT remove them from the room).
zh_cn: 此函数将从给定系统中移除指定的发射器，并将其从内存中清除(这也将阻止给定发射器产生任何粒子，但不会将它们从房间中移除)。

source: This function will rename the specified file with the specified name.
zh_cn: 此函数将用指定的名字重命名指定的文件。

source: This function will replace a sprite font that you created previously using the function font_add_sprite_ext().
zh_cn: 此函数将取代您之前使用函数font_add_sprite_ext()创建的精灵字体。

source: This function will replace the value at the given position for another one.
zh_cn: 此函数将把给定位置的值替换为另一个值。

source: This function will reset all achievements back to their initial values for the game.
zh_cn: 此函数会将游戏中的所有成就重置回初始值。

source: This function will resize a surface to the given dimensions (in pixels).
zh_cn: 此函数将调整表面的大小到给定的尺寸(以像素为单位)。

source: This function will restart the current room, as if it had just been entered.
zh_cn: 此函数将重新启动当前房间，就像刚刚进入一样。

source: This function will resume the given sync group if it is playing and has previously been paused (using the function audio_pause_sync_group).
zh_cn: 此函数将恢复给定的同步组，如果它正在播放并且之前已经暂停过(使用函数audio_pause_sync_group)。

source: This function will resume the video
zh_cn: 此函数将恢复视频

source: This function will retrieve the surface ID assigned to one of the 4 render targets available to surfaces.
zh_cn: 此函数将检索分配给表面可用的4个渲染目标之一的表面ID。

source: This function will return a DS Map with information about the given recorder source index.
zh_cn: 此函数将返回一个DS map，其中包含关于给定录音机源索引的信息。

source: This function will return a byte of data from current position within the file with the given file ID.
zh_cn: 此函数将从给定文件ID的文件中的当前位置返回一个字节的数据。

source: This function will return a copy of a given string with everything but its letters and digits removed, which means it can be used to remove any unwanted characters (like "#" or "?") from, for example, a login name or a password.
zh_cn: 此函数将返回一个给定字符串的副本，除了字母和数字以外的所有内容都被删除，这意味着它可以用于从例如登录名或密码中删除任何不需要的字符(如"#"或"?")。

source: This function will return a special value that relates to the position of the given sprite and sub-image on the texture page used by your game.
zh_cn: 此函数将返回一个特殊的值，该值与给定的精灵和子图像在游戏使用的纹理页面上的位置有关。

source: This function will return a string containing the name of the given audio group for displaying or checking.
zh_cn: 此函数将返回一个字符串，其中包含用于显示或检查的给定音频组的名称。

source: This function will return a string of the text contained on the clipboard.
zh_cn: 此函数将返回剪贴板上包含的文本字符串。

source: This function will return a string with the description of the given gamepad, for example, a PS3 controller may return a string similar to "PLAYSTATION(R)3 Controller", or an XBox360 controller could return "Xbox 360 Controller (XInput STANDARD GAMEPAD)".
zh_cn: 此函数将返回一个带有给定手柄描述的字符串，例如，PS3控制器可能返回一个类似于"PLAYSTATION(R)3控制器"的字符串，或者XBox360控制器可能返回"Xbox 360控制器(XInput STANDARD gamepad)"。

source: This function will return a struct containing all the data for the given animation curve.
zh_cn: 此函数将返回一个包含给定动画曲线的所有数据的结构。

source: This function will return an array of values associated with any given bounding box for the currently assigned skeleton animation sprite.
zh_cn: 此函数将返回与当前指定的骨骼动画精灵的任何给定边界框相关联的值数组。

source: This function will return an array populated with the unique ID values of each layer in the room.
zh_cn: 此函数将返回一个数组，数组中填充了房间中每个层的惟一ID值。

source: This function will return an array with the total bounding box value for all the individual bounding boxes assigned to a skeleton animation sprite.
zh_cn: 此函数将返回一个数组，其中包含分配给骨骼动画精灵的所有单个边界框的总边界框值。

source: This function will return one of two constants GameMaker has to tell you whether the device running the game is being held in landscape or portrait mode (see the table below).
zh_cn: 此函数将返回两个常量之一，GameMaker将告诉您运行游戏的设备是处于横向模式还是纵向模式(见下表)。

source: This function will return the "size" of the list, ie: the number of items that have been added into it.
zh_cn: 此函数将返回列表的"大小",即:已经添加到列表中的项目数。

source: This function will return the "size" of the priority queue, ie: the number of items that have been prioritized in it.
zh_cn: 此函数将返回优先队列的"大小"，即:队列中已优先排序的项目的数量。

source: This function will return the "size" of the queue, ie: the number of items that have been queued onto it.
zh_cn: 此函数将返回队列的"大小",即:队列中的项目数。

source: This function will return the "size" of the stack, ie: the number of items that have been pushed onto it.
zh_cn: 此函数将返回堆栈的"大小",即:已经被推到堆栈上的项目的数量。

source: This function will return the IP address of the given URL.
zh_cn: 此函数将返回给定URL的IP地址。

source: This function will return the amount of times the given substring appears within a specific string.
zh_cn: 此函数将返回给定子串在特定字符串中出现的次数。

source: This function will return the bit-mask data that defines the current default (global) mask for the audio listeners.
zh_cn: 此函数将返回位掩码数据，该数据定义了音频的当前默认(全局)屏蔽。

source: This function will return the bit-mask data that defines which audio listeners a sound should be played from.
zh_cn: 此函数将返回位掩码(bit-mask)数据，该数据定义了声音应该从哪个音频播放。

source: This function will return the bit-mask data that defines which audio listeners an emitter should play sounds from.
zh_cn: 此函数将返回位掩码数据，该数据定义了发射器应该从哪个音频播放声音。

source: This function will return the character position of an instance of a sub-string within a string, searching backwards through the string from the position given as the starting position.
zh_cn: 此函数将返回一个字符串中子字符串实例的字符位置，从给定的起始位置开始向后搜索整个字符串。

source: This function will return the character position of an instance of a sub-string within a string, searching forwards through the string from the position given as the starting position.
zh_cn: 此函数将返回一个字符串中子字符串实例的字符位置，从给定的起始位置开始向前搜索整个字符串。

source: This function will return the character position of an instance of a sub-string within a string, searching from the beginning of the string (to search from the end, use the function string_last_pos()).
zh_cn: 此函数将返回字符串中子字符串实例的字符位置，从字符串的开始搜索(要从末尾搜索，使用函数string_last_pos())。

source: This function will return the character position of an instance of a sub-string within a string, searching from the end of the string to the beginning (so the reverse of string_pos().
zh_cn: 此函数将返回一个子字符串的实例在一个字符串中的字符位置，从字符串的末尾搜索到开头(与string_pos()相反)。

source: This function will return the current "mode" for the bounding box calculations.
zh_cn: 此函数将返回边界框计算的当前"模式"。

source: This function will return the current colour used for ambient lighting.
zh_cn: 此函数将返回环境照明的当前颜色。

source: This function will return the current d3d device pointer, which you can then (for example) pass through to a DLL or Dylib on Windows and macOS.
zh_cn: 此函数将返回当前的d3d设备指针，然后(举例来说)您可以将它传递给Windows和macOS上的DLL或Dylib。

source: This function will return the current epsilon value for the target platform.
zh_cn: 此函数将返回目标平台的当前epsilon值。

source: This function will return the current gain value for the given sound.
zh_cn: 此函数将返回给定声音的当前增益值。

source: This function will return the current height in pixels of the virtual keyboard, based on the size of the display.
zh_cn: 此函数将根据显示器的大小返回虚拟键盘的当前高度(以像素为单位)。

source: This function will return the current position of the specified animation track in the range (0.0 to 1.0).
zh_cn: 此函数将返回指定动画轨道在0.0到1.0范围内的当前位置。

source: This function will return the current room being targeted by the layer functions.
zh_cn: 此函数将返回层函数所针对的当前房间。

source: This function will return the duration of video in milliseconds
zh_cn: 此函数将以毫秒为单位返回视频的持续时间

source: This function will return the format of the surface
zh_cn: 此函数将返回表面的格式

source: This function will return the frame number of the animation on the specified animation track.
zh_cn: 此函数将返回指定动画轨道上动画的帧号。

source: This function will return the group gain of a given audio group.
zh_cn: 这个函数将返回给定音频组的组增益。

source: This function will return the height (in pixels) of the input string, taking into account the line separation and any line-breaks the text may have.
zh_cn: 此函数将返回输入字符串的高度(以像素为单位),考虑到文本的行间距和任何换行符。

source: This function will return the height (in pixels) of the input string, taking into account the line separation and line-break width (which is defined as the number of pixels that the string can occupy before a line break is inserted).
zh_cn: 此函数将返回输入字符串的高度(以像素为单位),其中考虑了行间距和换行符宽度(定义为在插入换行符之前字符串可以占据的像素数)。

source: This function will return the height of the display (in pixels).
zh_cn: 此函数将返回显示的高度(以像素为单位)。

source: This function will return the height of the given grid.
zh_cn: 此函数将返回给定网格的高度。

source: This function will return the hue of the given color.
zh_cn: 这个函数将返回给定颜色的色调。

source: This function will return the hue of the given colour.
zh_cn: 此函数将返回给定颜色的色调。

source: This function will return the index ID value of the shader currently being used for rendering, or it will return -1 if no shader is being used.
zh_cn: 此函数将返回当前用于渲染的着色器的索引ID值，如果没有使用着色器，它将返回-1。

source: This function will return the index of a newly created sprite that is a duplicate (copy) of the one input as the "index" argument.
zh_cn: 此函数将返回一个新创建的精灵的索引，这个精灵是一个输入的副本。

source: This function will return the index value for any given animation curve channel.
zh_cn: 此函数将返回任何给定动画曲线通道的索引值。

source: This function will return the length of the given sound in seconds.
zh_cn: 此函数将以秒为单位返回给定声音的长度。

source: This function will return the maximum width (in pixels) of the input string, taking into account the line separation and line-break width (which is defined as the number of pixels that the string can occupy before a line break is inserted).
zh_cn: 此函数将返回输入字符串的最大宽度(以像素为单位)，考虑到行分隔和换行宽度(定义为插入换行之前字符串可以占用的像素数)。

source: This function will return the mouse x position relative to the view selected.
zh_cn: 此函数将返回相对于所选视图的鼠标x位置。

source: This function will return the mouse x position within the screen.
zh_cn: 此函数将返回鼠标在屏幕中的x位置。

source: This function will return the mouse y position relative to the view selected.
zh_cn: 此函数将返回相对于所选视图的鼠标y位置。

source: This function will return the mouse y position within the screen.
zh_cn: 此函数将返回鼠标在屏幕中的y位置。

source: This function will return the name as a string of the specified object.
zh_cn: 此函数将返回指定对象的字符串形式的名称。

source: This function will return the name as a string of the specified script.
zh_cn: 此函数将以指定脚本的字符串形式返回名称。

source: This function will return the name as a string of the specified sprite.
zh_cn: 此函数将以指定精灵的字符串形式返回名称。

source: This function will return the name as a string of the specified tile set.
zh_cn: 此函数将以指定图块集的字符串形式返回名称。

source: This function will return the name of a given audio resource as a string.
zh_cn: 此函数将以字符串形式返回给定音频资源的名称。

source: This function will return the name of the animation set currently used by the given track number (as set by the function skeleton_animation_set_ext).
zh_cn: 此函数将返回给定轨道编号当前使用的动画集的名称(由函数skeleton_animation_set_ext设置)。

source: This function will return the name of the first file that satisfies the mask and the attributes.
zh_cn: 此函数将返回满足掩码和属性的第一个文件的名称。

source: This function will return the name of the path that is referenced as a string.
zh_cn: 此函数将返回被引用为字符串的路径名。

source: This function will return the name of the skin (as a string) that is currently assigned to the skeletal animation sprite your instance is using.
zh_cn: 此函数将返回当前分配给实例正在使用的骨骼动画精灵的皮肤名称(作为字符串)。

source: This function will return the number of "axis" controls on the device being checked.
zh_cn: 此函数将返回被检查设备上"轴"控件的数量。

source: This function will return the number of audio recording sources (like microphones, etc...) currently available to your game.
zh_cn: 此函数将返回当前游戏中可用的音频记录源(如麦克风等)的数量。

source: This function will return the number of bounding boxes associated with the skeleton animation sprite assigned to the instance running the code.
zh_cn: 此函数将返回与分配给运行代码的实例的骨架动画精灵相关联的边界框的数量。

source: This function will return the number of listeners available.
zh_cn: 此函数将返回可用侦听器的数量。

source: This function will return the number of particles that are active in a physics enabled room.
zh_cn: 此函数将返回物理房间中活跃的粒子数量。

source: This function will return the number of particles that are active in a single group.
zh_cn: 此函数将返回单个组中活动的粒子数。

source: This function will return the position of video in milliseconds
zh_cn: 此函数将以毫秒为单位返回视频的位置

source: This function will return the saturation of the given color.
zh_cn: 这个函数将返回给定颜色的饱和度。

source: This function will return the saturation of the given colour.
zh_cn: 此函数将返回给定颜色的饱和度。

source: This function will return the size (in bytes) of a file that has been opened for reading and/or writing.
zh_cn: 此函数将返回一个文件的大小(以字节为单位),这个文件已经被打开进行读取和/或写入。

source: This function will return the size (in bytes) of any of the given data constants (listed here).
zh_cn: 此函数将返回任何给定数据常量(此处列出)的大小(以字节为单位)。

source: This function will return the smallest angle difference between two angles as a value between -180 and 180 degrees (where a positive angle is anti-clockwise and a negative angle clockwise).
zh_cn: 此函数将返回两个角之间的最小角差，即-180度到180度之间的值(其中正角为逆时针，负角为顺时针)。

source: This function will return the status of the video
zh_cn: 此函数将返回视频的状态

source: This function will return the struct containing the channel data for the channel specified in an animation curve asset.
zh_cn: 此函数将返回包含动画曲线资源中指定的通道数据的结构。

source: This function will return the time required for the given animation set to run before looping back to the beginning.
zh_cn: 此函数将返回给定动画集在循环返回开始之前运行所需的时间。

source: This function will return the total number of buttons available for the gamepad connected to the given device "slot".
zh_cn: 此函数将返回连接到给定设备"插槽"的手柄的可用按钮总数。

source: This function will return the total number of hats available for the gamepad connected to the given device "slot".
zh_cn: 此函数将返回连接到给定设备"插槽"的手柄上可用的帽子(hats)总数。

source: This function will return the value (luminosity) of the given color.
zh_cn: 这个函数将返回给定颜色的值(亮度)。

source: This function will return the value (luminosity) of the given colour.
zh_cn: 此函数将返回给定颜色的值(光度)。

source: This function will return the value of the moment in which the timeline performs its final action.
zh_cn: 此函数将返回时间轴执行其最终动作的时刻的值。

source: This function will return the value that has the highest priority in the queue and then remove the value (and priority) from the data structure.
zh_cn: 此函数将返回队列中优先级最高的值，然后从数据结构中删除该值(和优先级)。

source: This function will return the value that has the lowest priority in the queue and then remove the value (and priority) from the data structure.
zh_cn: 此函数将返回队列中优先级最低的值，然后从数据结构中删除该值(和优先级)。
